lvx/base/DataProcessors/бит_ИзменениеОтраженийФакта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ИзменениеОтраженийФакта</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Comment>Компоновщик</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбрабатываемыеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ОтражениеФактаДДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АналитикиШапки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АналитикиТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Безусловно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/DataProcessors/бит_ИзменениеОтраженийФакта/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


//  Процедура устанавливает заголовок формы на клиенте.
//
&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		
		ЭтотОбъект.Заголовок = "Изменение отражений факта ("+ТекущаяНастройка+")";
		
		
	Иначе	
		
		ЭтотОбъект.Заголовок = "Изменение отражений факта";
		
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗаголовокФормы()


////////////////////////////////////////////////////////////////////////////////
// ДЕЙСТВИЯ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ПолучитьДанные();

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ОбрабатываемыеДокументы, "Выполнить", 1, Элементы.ОбрабатываемыеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастроитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Объект.Период;
	
	Оповещение = Новый ОписаниеОповещения("РедактироватьПериодОкончание", ЭтотОбъект); 
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

// Процедура окончание процедуры "РедактироватьПериод".
// 
&НаКлиенте 
Процедура РедактироватьПериодОкончание(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда		
		Объект.Период = Период;		
	КонецЕсли;	
	
КонецПроцедуры // РедактироватьПериодОкончание()

&НаКлиенте
Процедура КомандаИнвертироватьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ОбрабатываемыеДокументы, "Выполнить", 2, Элементы.ОбрабатываемыеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОбработатьФлагиТаблицы(Объект.ОбрабатываемыеДокументы, "Выполнить", 0, Элементы.ОбрабатываемыеДокументы);
	
 КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	ЗаполнитьОбрабатываемыеДокументы();	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ "АналитикиШапки"

&НаКлиенте
Процедура АналитикиШапкиАналитикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.АналитикиШапки.ТекущиеДанные;
	ИзменениеАналитикиШапки(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиШапкиЗначениеАналитикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.АналитикиШапки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Контейнер = Новый Соответствие;
	Контейнер.Вставить(ТекущиеДанные.ИмяАналитики, ТекущиеДанные.ЗначениеАналитики);
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
														  	   , Элемент
															   , Контейнер
															   , ТекущиеДанные.ИмяАналитики
															   , СтандартнаяОбработка
															   , фКэшЗначений.НастройкиАналитик);
															   
	ТекущиеДанные.ЗначениеАналитики = Контейнер.Получить(ТекущиеДанные.ИмяАналитики);
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиШапкиЗначениеАналитикиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.АналитикиШапки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контейнер = Новый Структура;
	Контейнер.Вставить(ТекущиеДанные.ИмяАналитики, ТекущиеДанные.ЗначениеАналитики);	

	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент
																			, Контейнер
																		   	, ТекущиеДанные.ИмяАналитики
																		   	, СтандартнаяОбработка
																		   	, фКэшЗначений.НастройкиАналитик);
																		
	ТекущиеДанные.ЗначениеАналитики = Контейнер[ТекущиеДанные.ИмяАналитики];														   
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ "АналитикиТЧ"

&НаКлиенте
Процедура АналитикиТЧНачальноеЗначениеАналитикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.АналитикиТЧ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Контейнер = Новый Соответствие;
	Контейнер.Вставить(ТекущиеДанные.ИмяАналитики, ТекущиеДанные.НачальноеЗначение);
	
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
														  	   , Элемент
															   , Контейнер
															   , ТекущиеДанные.ИмяАналитики
															   , СтандартнаяОбработка
															   , фКэшЗначений.НастройкиАналитик);
															   
	ТекущиеДанные.НачальноеЗначение = Контейнер.Получить(ТекущиеДанные.ИмяАналитики);
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиТЧКонечноеЗначениеАналитикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.АналитикиТЧ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Контейнер = Новый Соответствие;
	Контейнер.Вставить(ТекущиеДанные.ИмяАналитики, ТекущиеДанные.КонечноеЗначение);
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
														  	   , Элемент
															   , Контейнер
															   , ТекущиеДанные.ИмяАналитики
															   , СтандартнаяОбработка
															   , фКэшЗначений.НастройкиАналитик);
															   
	ТекущиеДанные.КонечноеЗначение = Контейнер.Получить(ТекущиеДанные.ИмяАналитики);
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиТЧНачальноеЗначениеАналитикиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.АналитикиТЧ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контейнер = Новый Структура;
	Контейнер.Вставить(ТекущиеДанные.ИмяАналитики, ТекущиеДанные.НачальноеЗначение);	

	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент
																			, Контейнер
																		   	, ТекущиеДанные.ИмяАналитики
																		   	, СтандартнаяОбработка
																		   	, фКэшЗначений.НастройкиАналитик);
																		
	ТекущиеДанные.НачальноеЗначение = Контейнер[ТекущиеДанные.ИмяАналитики];														   
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиТЧКонечноеЗначениеАналитикиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.АналитикиТЧ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контейнер = Новый Структура;
	Контейнер.Вставить(ТекущиеДанные.ИмяАналитики, ТекущиеДанные.КонечноеЗначение);	

	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент
																			, Контейнер
																		   	, ТекущиеДанные.ИмяАналитики
																		   	, СтандартнаяОбработка
																		   	, фКэшЗначений.НастройкиАналитик);
																		
	ТекущиеДанные.КонечноеЗначение = Контейнер[ТекущиеДанные.ИмяАналитики];														   
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикиТЧБезусловноПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.АналитикиТЧ.ТекущиеДанные;
	
	
	Если ТекущиеДанные.Безусловно Тогда
	
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Контейнер = Новый Структура;
		Контейнер.Вставить(ТекущиеДанные.ИмяАналитики, ТекущиеДанные.НачальноеЗначение);	

		ОбработкаОчисткиНачальногоЗначения(Контейнер
									   	, ТекущиеДанные.ИмяАналитики
									   	, фКэшЗначений.НастройкиАналитик);
																				
		ТекущиеДанные.НачальноеЗначение = Контейнер[ТекущиеДанные.ИмяАналитики];														   
	
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ НА СЕРВЕРЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// стандартные действия при создании на сервере
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	ОбрОб = РеквизитФормыВЗначение("Объект");
	МетаОбъект = ОбрОб.Метаданные();
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// инициализируем настройки компоновщика
	АдресСхемыКомпоновкиДанных = ИнициализироватьКомпоновщик(Объект.Компоновщик,УникальныйИдентификатор);
	
	Элементы.КомпоновщикПользовательскиеНастройки.РежимОтображения = РежимОтображенияНастроекКомпоновкиДанных.БыстрыйДоступ;	
	
	ЗаполнитьКэшЗначений();
	
	Если ЗначениеЗаполнено(Параметры.ДокументыДляОбработки) И ТипЗнч(Параметры.ДокументыДляОбработки) = Тип("Массив") Тогда							
		ПодготовитьПоСпискуДокументов();
	Иначе
		Объект.Период.Вариант = ВариантСтандартногоПериода.Сегодня;
	КонецЕсли;
	
	УстановитьЗначенияПоУмолчанию();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//  Процедура заполняет значения, необходимые для работы на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	фКэшЗначений = Новый Структура;
	фКэшЗначений.Вставить("ИзмеренияДоп"     	, бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"));
	// настройки дополнительных измерений
	фКэшЗначений.Вставить("НастройкиИзмерений"	, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	// настройки всех дополнительных аналитик
	фКэшЗначений.Вставить("НастройкиАналитик"	, бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхАналитик());
	
	
	фКэшЗначений.Вставить("ТипНастройки"		, Перечисления.бит_ТипыСохраненныхНастроек.Обработки);
	фКэшЗначений.Вставить("НастраиваемыйОбъект"	, Метаданные.Обработки.бит_ИзменениеОтраженийФакта.ПолноеИмя());
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура ПодготовитьПоСпискуДокументов()
	
	Для каждого Документ Из Параметры.ДокументыДляОбработки Цикл
		Если НЕ ЗначениеЗаполнено(Документ) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаДокумента = Объект.ОбрабатываемыеДокументы.Добавить();
		НоваяСтрокаДокумента.Документ  = Документ;
		НоваяСтрокаДокумента.Выполнить = Истина;
	КонецЦикла;
	
	Объект.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	Обработки.бит_ИзменениеОтраженийФакта.ЗаполнитьАналитикиТабличнойЧасти(Объект.АналитикиТЧ);
	ЭтотОбъект.ТекущийЭлемент = Элементы.ЗаполнениеАналитик;

КонецПроцедуры

//  Процедура дозаполняет строку аналитик. 
//
&НаСервере
Процедура ДозаполнитьСтрокуАналитикШапки(ТекущаяСтрока)

	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Аналитика) Тогда
			
			ОписаниеТиповАналитики = ТекущаяСтрока.Аналитика.ТипЗначения;
			ТекущаяСтрока.ЗначениеАналитики = ОписаниеТиповАналитики.ПривестиЗначение(ТекущаяСтрока.ЗначениеАналитики);
			
			// для дополнительных значений аналитик необходимо проверить владельца
			Если ТипЗнч(ТекущаяСтрока.ЗначениеАналитики) = Тип("СправочникСсылка.бит_ДополнительныеЗначенияАналитик") 
				 И ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеАналитики) Тогда
			
				Если НЕ ТекущаяСтрока.ЗначениеАналитики.Владелец = ТекущаяСтрока.Аналитика Тогда
				
					ТекущаяСтрока.ЗначениеАналитики = Справочники.бит_ДополнительныеЗначенияАналитик.ПустаяСсылка();
				
				КонецЕсли; 
			
			КонецЕсли; 
			
			ТекущаяСтрока.ИмяАналитики = СокрЛП(ТекущаяСтрока.Аналитика.Код);
			
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры // ДозаполнитьСтрокуАналитик()

//  Процедура инициализирует компоновщик. 
//
&НаСервере
Функция ИнициализироватьКомпоновщик(Компоновщик,УникальныйИдентификатор)

	СхемаКомпоновкиДанных = Обработки.бит_ИзменениеОтраженийФакта.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//меняем синонимы аналитик в отборе по фактическим данным
	мНастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Префиксы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ФактическиеДанные");
	бит_МеханизмДопИзмерений.СформироватьЗаголовкиПолейДополнительныхИзмеренийВСКД(
						СхемаКомпоновкиДанных, 
						"НаборДанных1", 
						мНастройкиИзмерений,,, Префиксы);	

	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
    Компоновщик.Инициализировать(ИсточникНастроек);
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	Возврат АдресСхемыКомпоновкиДанных;
	
КонецФункции // ИнициализироватьКомпоновщик()

//  Процедура получает данные . 
//
&НаСервере
Процедура ПолучитьДанные()

	ОбОбъект = РеквизитФормыВЗначение("Объект");
	ОбОбъект.ОбработатьДанные();
	ЗначениеВДанныеФормы(ОбОбъект, Объект);
	
КонецПроцедуры // ПолучитьДанные()

//  Процедура обрабатывает изменение аналитики в строке таблицы. 
//
&НаСервере
Процедура ИзменениеАналитикиШапки(ИдСтроки)
	
	ТекущаяСтрока = Объект.АналитикиШапки.НайтиПоИдентификатору(ИдСтроки);
	ДозаполнитьСтрокуАналитикШапки(ТекущаяСтрока);
	
КонецПроцедуры // ИзменениеАналитики()

//  Процедура заполняет обрабатываемый документ.
// 
//Параметры:
//  ИдСтроки - число.
//  
&НаСервере
Процедура ЗаполнитьОбрабатываемыеДокументы()

	Для каждого Док Из Объект.ОбрабатываемыеДокументы Цикл
		
		Если Док.Выполнить Тогда
			
			ДокОб = Док.Документ.ПолучитьОбъект();	
			ЗаполнитьДокумент(ДокОб);
			
			//Запись измененного документа и проведение по регистрам бит_.
			ЗаписьУспешна = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокОб, РежимЗаписиДокумента.Запись); 
			
			Если ЗаписьУспешна И Док.Документ.ДокументОснование.Проведен Тогда 
				
				ДокОб.ПровестиОтражениеДДС(ДокОб.Ссылка, Ложь);
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьОбрабатываемыеДокументы()

//  Процедура заполняет шапку и табличную часть документа отражение факта ДДС. 
//
&НаСервере
Процедура ЗаполнитьДокумент(ДокОб)

	Если НеСинхронизировать = 1 Тогда
		
		ДокОб.НеСинхронизировать = Истина;
		
	ИначеЕсли НеСинхронизировать = 2 Тогда	
		
		ДокОб.НеСинхронизировать = Ложь;
		
	КонецЕсли; 
	
	Если НеСинхронизироватьСумму = 1 Тогда
		
		ДокОб.НеСинхронизироватьСумму = Истина;
		
	ИначеЕсли НеСинхронизироватьСумму = 2 Тогда	
		
		ДокОб.НеСинхронизироватьСумму = Ложь;
		
	КонецЕсли; 
	
	Для каждого ТекСтрокаШапки Из Объект.АналитикиШапки Цикл
	
		Для каждого Аналит Из ДокОб.Аналитики Цикл
		
			Если Аналит.Аналитика = ТекСтрокаШапки.Аналитика Тогда
			
				Аналит.ЗначениеАналитики = ТекСтрокаШапки.ЗначениеАналитики; 
			
			КонецЕсли; 
		
		КонецЦикла;
	
	КонецЦикла; 
	
	Для каждого ТекСтрокаТЧ Из Объект.АналитикиТЧ Цикл
		
		Если ЗначениеЗаполнено(ТекСтрокаТЧ.НачальноеЗначение) 
			ИЛИ ЗначениеЗаполнено(ТекСтрокаТЧ.КонечноеЗначение) Тогда 
		
			Для каждого Аналит Из ДокОб.ФактическиеДанные Цикл
			
				Если Аналит[ТекСтрокаТЧ.Ключ] = ТекСтрокаТЧ.НачальноеЗначение Тогда	
					
					Аналит[ТекСтрокаТЧ.Ключ] = ТекСтрокаТЧ.КонечноеЗначение; 
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ТекСтрокаТЧ.Безусловно Тогда
		
			Для каждого Аналит Из ДокОб.ФактическиеДанные Цикл
			
				Аналит[ТекСтрокаТЧ.Ключ] = ТекСтрокаТЧ.КонечноеЗначение; 
				
			КонецЦикла;
		
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьДокумент()

//  Процедура устанавливает заголовок формы.
//
&НаСервере
Процедура УстановитьЗаголовокФормыСервер()

	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		
		ЭтотОбъект.Заголовок = "Изменение отражений факта ("+ТекущаяНастройка+")";
		
		
	Иначе	
		
		ЭтотОбъект.Заголовок = "Изменение отражений факта";
		
		
	КонецЕсли; 

КонецПроцедуры // УстановитьЗаголовокФормы()

////////////////////////////////////////////////////////////////////////////////
// РАБОТА С НАСТРОЙКАМИ

//  Процедура - действие команды "КомандаСохранитьНастройки".
//
&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	
	ПараметрыФормы     = Новый Структура;
	СтруктураНастройки = УпаковатьНастройкиВСтруктуру();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СтруктураНастройки);
	ПараметрыФормы.Вставить("ТипНастройки"		 , фКэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", фКэшЗначений.НастраиваемыйОбъект);
	
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
	
		ПараметрыФормы.Вставить("СохраненнаяНастройка",ТекущаяНастройка);
	
	КонецЕсли; 
		
	СохрНастройка = ОткрытьФормуМодально("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения",
										ПараметрыФормы,
										ЭтотОбъект);
										
	Если ЗначениеЗаполнено(СохрНастройка) Тогда
		
		ТекущаяНастройка = СохрНастройка;
		УстановитьЗаголовокФормы();
		
	КонецЕсли;
	
КонецПроцедуры //КомандаСохранитьНастройки()

//  Процедура - действие команды "КомандаВосстановитьНастройки".
//
&НаКлиенте
Процедура КомандаВосстановитьНастройки(Команда)
	
	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("ТипНастройки"		 , фКэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", фКэшЗначений.НастраиваемыйОбъект);
	
	ВыбНастройка = ОткрытьФормуМодально("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки",
	ПараметрыФормы,
	ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ВыбНастройка) Тогда        
		
		ПрименитьНастройки(ВыбНастройка);
		
	КонецЕсли;	
	
КонецПроцедуры // КомандаВосстановитьНастройки()

//  Функция готовит стуктуру с настройками для сохранения.
//
// Возвращаемое значение:
//   СтруктураНастройки   - Структура
//
&НаСервере
Функция УпаковатьНастройкиВСтруктуру()

	СтруктураНастройки = Новый Структура;
	
	СтруктураНастройки.Вставить("СтандартныйПериод" 		, Объект.Период);
	СтруктураНастройки.Вставить("НеСинхронизировать" 		, НеСинхронизировать);
	СтруктураНастройки.Вставить("НеСинхронизироватьСумму" 	, НеСинхронизироватьСумму);
	СтруктураНастройки.Вставить("ПользовательскиеНастройки"	, Новый ХранилищеЗначения(Объект.Компоновщик.ПользовательскиеНастройки));
	
	Возврат СтруктураНастройки;
	
КонецФункции // УпаковатьНастройкиВСтруктуру()

//  Функция применяет сохраненные настройки.
//
// Параметры:
//  ВыбНастройка  - СправочникСсылка.бит_СохраненныеНастройки
//
&НаСервере
Функция ПрименитьНастройки(ВыбНастройка)

	Если ЗначениеЗаполнено(ВыбНастройка) Тогда
		
		СтруктураНастроек = ВыбНастройка.ХранилищеНастроек.Получить();
		
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			
			ПользовательскиеНастройки = СтруктураНастроек.ПользовательскиеНастройки.Получить();
			
			Объект.Компоновщик.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
			Объект.Период 			= СтруктураНастроек.СтандартныйПериод;
			НеСинхронизировать 		= СтруктураНастроек.НеСинхронизировать;
			НеСинхронизироватьСумму = СтруктураНастроек.НеСинхронизироватьСумму;
			
			ТекущаяНастройка = ВыбНастройка;
			УстановитьЗаголовокФормыСервер();				
				
		КонецЕсли;	 
		
	Иначе	
		НеСинхронизировать 		= 0;
		НеСинхронизироватьСумму = 0;
	КонецЕсли; 
	
КонецФункции // ПрименитьНастройки()

//  Процедура устанавливает настройку либо из последних использованных, 
//	либо из настройки по умолчанию.
//
&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	// Получим настройку по умолчанию
	СохрНастройка = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(фКэшЗначений.НастраиваемыйОбъект);
	
	Если ЗначениеЗаполнено(СохрНастройка) Тогда
		
		ПрименитьНастройки(СохрНастройка);
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьЗначенияПоУмолчанию()

//  Процедура 
//
//  Параметры:
//  Контейнер - СтрокаТабличнойЧасти,ДокументОбъект
//  ИмяПоля   - Строка
//  НастройкиИзмерений - Соответствие
//
 &НаСервере
 Процедура ОбработкаОчисткиНачальногоЗначения(Контейнер, ИмяПоля, НастройкиИзмерений)
 
	Если Контейнер = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если НастройкиИзмерений[ИмяПоля] <> Неопределено Тогда
		
		Если НастройкиИзмерений[ИмяПоля].ЭтоСоставнойТип Тогда
			Контейнер[ИмяПоля]   = Неопределено;
		Иначе	
			Контейнер[ИмяПоля]   = НастройкиИзмерений[ИмяПоля].ЗначениеПоУмолчанию;
		КонецЕсли; 
		
	КонецЕсли; 
	
 КонецПроцедуры // ОбработкаОчисткиНачальногоЗначения()
